{
  "meta": {
    "title": "Latest Rotations - Rotate to Escape News",
    "description": "Stay updated with the latest news, updates, and community highlights from the Rotate to Escape universe."
  },
  "pageTitle": "Latest Rotations",
  "pageSubtitle": "Stay updated with the newest twists and turns in the Rotate to Escape universe",
  "articles": [
    {
      "id": 1,
      "title": "Major Update: 50 New Levels Added to Rotate to Escape!",
      "excerpt": "We're thrilled to announce the biggest content update yet! Discover 50 brand new levels featuring innovative rotation mechanics, new trap types, and mind-bending puzzles that will test even the most experienced players.",
      "content": "Full article content here...",
      "image": "./img/news-1.jpg",
      "category": "Updates",
      "date": "2024-01-15",
      "featured": true
    },
    {
      "id": 2,
      "title": "Community Spotlight: Player Creates Incredible Speed Run Record",
      "excerpt": "Australian player 'RotationMaster_AU' has shattered the previous speed run record, completing all 100 levels in just 47 minutes! Watch the incredible run and learn the advanced techniques used.",
      "content": "Full article content here...",
      "image": "./img/news-2.png",
      "category": "Community",
      "date": "2024-01-12"
    },
    {
      "id": 3,
      "title": "Developer Diary: The Art of Designing Rotation Puzzles",
      "excerpt": "Go behind the scenes with our lead puzzle designer as they share insights into creating challenging yet fair rotation-based puzzles. Learn about the design philosophy that makes each level unique.",
      "content": "Full article content here...",
      "image": "./img/news-3.png",
      "category": "Development",
      "date": "2024-01-10"
    },
    {
      "id": 4,
      "title": "Mobile Version Coming Soon: Rotate on the Go!",
      "excerpt": "The mobile version of Rotate to Escape is entering final testing phases. Experience the same mind-bending puzzles with touch-optimized controls designed specifically for mobile devices.",
      "content": "Full article content here...",
      "image": "./img/news-4.png",
      "category": "Announcements",
      "date": "2024-01-08"
    },
    {
      "id": 5,
      "title": "Tips from the Pros: Advanced Rotation Strategies",
      "excerpt": "Learn from the best players in the community! This comprehensive guide covers advanced techniques, optimal rotation patterns, and time-saving strategies for competitive play.",
      "content": "Full article content here...",
      "image": "./img/news-5.png",
      "category": "Guides",
      "date": "2024-01-05"
    },
    {
      "id": 6,
      "title": "Holiday Event: Festive Rotation Challenges Available Now",
      "excerpt": "Celebrate the season with special holiday-themed levels! These limited-time challenges feature festive decorations and unique rotation mechanics. Complete them all to unlock exclusive rewards.",
      "content": "Full article content here...",
      "image": "./img/news-6.png",
      "category": "Events",
      "date": "2024-01-03"
    }
  ]
}
